content/topics/cia.md
+++
title = "CIA"
tags = ["security"]
draft = false
+++

## Confidentiality {#confidentiality}

-   Keep it secret
-   Authentication
-   Authorization
-   Data access


## Integrity {#integrity}

-   All about data
    -   Who can change it
    -   When can it be changed
    -   And in which ways
-   Understand and keep the current state of data


## Availability {#availability}

-   Keep the systems running
-   Also find the right balance between the security controls (restrictions) and the features we expose to the outside world and our customers